{
  "_name_or_path": "Bllossom/llama-3.2-Korean-Bllossom-AICA-5B",
  "architectures": [
    "MllamaForConditionalGeneration"
  ],
  "image_token_index": 128256,
  "model_type": "mllama",
  "quantization_config": {
    "_load_in_4bit": true,
    "_load_in_8bit": false,
    "bnb_4bit_compute_dtype": "float32",
    "bnb_4bit_quant_storage": "uint8",
    "bnb_4bit_quant_type": "fp4",
    "bnb_4bit_use_double_quant": false,
    "llm_int8_enable_fp32_cpu_offload": true,
    "llm_int8_has_fp16_weight": false,
    "llm_int8_skip_modules": null,
    "llm_int8_threshold": 6.0,
    "load_in_4bit": true,
    "load_in_8bit": false,
    "quant_method": "bitsandbytes"
  },
  "text_config": {
    "cross_attention_layers": [
      3,
      8,
      13,
      18,
      23,
      28,
      33
    ],
    "hidden_size": 3072,
    "intermediate_size": 8192,
    "model_type": "mllama_text_model",
    "num_attention_heads": 24,
    "num_hidden_layers": 35,
    "rope_scaling": {
      "factor": 32.0,
      "high_freq_factor": 4.0,
      "low_freq_factor": 1.0,
      "original_max_position_embeddings": 8192,
      "rope_type": "llama3"
    }
  },
  "torch_dtype": "bfloat16",
  "transformers_version": "4.48.1",
  "use_cache": false,
  "vision_config": {
    "image_size": 560,
    "model_type": "mllama_vision_model"
  }
}
